[net]
batch=128
subdivisions=1
width=320
height=320
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1


learning_rate=0.001
burn_in=4000
max_batches=200000
policy=steps
steps=150000,180000
scales=.1,.1

[convolutional]
filters=8
size=3
pad=1
stride=2
batch_normalize=1
activation=leaky


[convolutional]
filters=8
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=8
filters=8
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=4
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[convolutional]
filters=8
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=8
filters=8
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=4
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=24
filters=24
size=3
pad=1
stride=2
batch_normalize=1
activation=leaky

[convolutional]
filters=8
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[convolutional]
filters=32
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=32
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=8
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=32
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=32
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=8
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=32
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=32
filters=32
size=3
pad=1
stride=2
batch_normalize=1
activation=leaky

[convolutional]
filters=8
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=48
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=8
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=48
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=8
size=1
stride=1
pad=0
batch_normalize=1
activation=linear




[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=48
filters=48
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=16
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=96
filters=96
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=16
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=96
filters=96
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=16
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=96
filters=96
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=16
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=96
filters=96
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=16
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=96
filters=96
size=3
pad=1
stride=2
batch_normalize=1
activation=leaky

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[convolutional]
filters=136
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=136
filters=136
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=136
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=136
filters=136
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=136
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=136
filters=136
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=136
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=136
filters=136
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=136
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=136
filters=136
size=3
pad=1
stride=2
batch_normalize=1
activation=leaky


[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[convolutional]
filters=224
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=224
filters=224
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=224
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=224
filters=224
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=224
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=224
filters=224
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=224
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=224
filters=224
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=224
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
groups=224
filters=224
size=3
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=linear

[dropout]
probability=.15

[shortcut]
from=-5
activation=linear

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=leaky

[convolutional]
filters=96
size=5
groups=96
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=128
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
filters=128
size=5
groups=128
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=128
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
size=1
stride=1
pad=1
filters=75
activation=linear


[yolo]
mask = 3,4,5
anchors = 26, 48,  67, 84,  72,175, 189,126, 137,236, 265,259
classes=20
num=6
jitter=.15
ignore_thresh = .5
truth_thresh = 1
random=0
scale_x_y = 1.0
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

[route]
layers = -7

[upsample]
stride = 2

[route]
layers=-1,81

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=96
size=5
groups=96
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
filters=96
size=5
groups=96
stride=1
pad=1
batch_normalize=1
activation=leaky

[convolutional]
filters=96
size=1
stride=1
pad=1
batch_normalize=1
activation=linear

[convolutional]
size=1
stride=1
pad=1
filters=75
activation=linear


[yolo]
mask = 0,1,2
anchors = 26, 48,  67, 84,  72,175, 189,126, 137,236, 265,259
classes=20
num=6
jitter=.15
ignore_thresh = .5
truth_thresh = 1
random=0
scale_x_y = 1.00
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6


